{"config": [{"config": {"trainable": true, "cropping": [[70, 25], [0, 0]], "name": "cropping2d_1", "data_format": "channels_last", "batch_input_shape": [null, 160, 320, 3], "dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"trainable": true, "output_shape": null, "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "dtype": "float32", "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa2D:/SDC/CarND-Behavioral-Cloning-P3-master/model.py\u00da\b<lambda>H\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "filters": 24, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "padding": "valid", "name": "conv2d_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "filters": 36, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "padding": "valid", "name": "conv2d_2", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "filters": 48, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "padding": "valid", "name": "conv2d_3", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_4", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_5", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 100, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "units": 50, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "trainable": true, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "trainable": true, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}